chriskinal/QuailTracker/esp32_bridge/src/main.c
/*
 * ESP32-C3 Bridge — BLE Beacon + SPI Slave + WiFi-on-Demand + WebSocket
 *
 * Power states:
 *   LOW_POWER:    BLE advertising only, WiFi off, SPI slave idle (~1-3mA)
 *   NORMAL_POWER: BLE + WiFi AP + SPI active, full web UI (~80mA)
 *
 * State transitions:
 *   Boot → LOW_POWER (BLE beacon starts)
 *   BLE connect OR SPI activity → NORMAL_POWER (WiFi starts, STM32 woken if sleeping)
 *   BLE disconnect + 30s timeout → LOW_POWER (WiFi stops)
 *   STM32 sends sleep command → LOW_POWER
 *
 * Wiring (ESP32-C3 Super Mini):
 *   GPIO4  = SCK
 *   GPIO6  = MOSI (master out, slave in)
 *   GPIO5  = MISO (master in, slave out)
 *   GPIO7  = CS (also used as wake output when STM32 is sleeping)
 */

#include <stdio.h>
#include <string.h>
#include <inttypes.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "driver/spi_slave.h"
#include "driver/gpio.h"
#include "esp_wifi.h"
#include "esp_event.h"
#include "esp_log.h"
#include "esp_http_server.h"
#include "nvs_flash.h"
#include "esp_netif.h"
#include "esp_mac.h"
#include "esp_ota_ops.h"
#include "lwip/sockets.h"
#include "lwip/netdb.h"
#include "ble_beacon.h"
#include "stm32_flash.h"

#define TAG "BRIDGE"
#define ESP_FW_VERSION "0.2.0"

/* ── Power State ───────────────────────────────────────────────── */

typedef enum {
    BRIDGE_LOW_POWER,     /* BLE only, WiFi off */
    BRIDGE_NORMAL_POWER,  /* BLE + WiFi + SPI */
} bridge_power_t;

static volatile bridge_power_t bridge_state = BRIDGE_NORMAL_POWER;
static volatile uint32_t disconnect_tick = 0;   /* tick when BLE disconnected */
static volatile bool stm32_sleeping = false;     /* true = STM32 in Stop 2 */
static bool wifi_started = false;

/* WiFi duty cycle for low-power mode: on 15s, off 45s.
 * Disabled by default — WiFi stays on continuously. */
static bool wifi_duty_cycle = false;
#define WIFI_DUTY_ON_MS   15000
#define WIFI_DUTY_OFF_MS  45000
bool spi_initialized = false;
static TaskHandle_t spi_task_handle = NULL;
static volatile bool spi_task_stop = false;

#define BLE_DISCONNECT_TIMEOUT_MS 30000  /* 30s before stopping WiFi */

/* ── SPI Slave Config ──────────────────────────────────────────── */

#define SPI_HOST       SPI2_HOST
#define PIN_MOSI       6
#define PIN_MISO       5
#define PIN_SCK        4
#define PIN_CS         7
#define TRANSFER_SIZE  1024

WORD_ALIGNED_ATTR uint8_t spi_rxBuf[TRANSFER_SIZE];
WORD_ALIGNED_ATTR uint8_t spi_txBuf[TRANSFER_SIZE];

/* Last received SPI data (for WebSocket push) */
static char last_spi_msg[TRANSFER_SIZE + 1] = "(none)";
static uint32_t spi_transaction_count = 0;
static bool new_spi_data = false;

/* Last known battery/state from SPI JSON (for BLE advertising) */
static uint16_t last_battery_mv = 0;
static uint8_t  last_recording = 0;
static uint8_t  last_pwr_state = 0;

/* Pending command from browser → STM32 (sent in next SPI tx) */
static char pending_cmd[512] = "";
static portMUX_TYPE cmd_mux = portMUX_INITIALIZER_UNLOCKED;

/* ── WiFi AP Config ────────────────────────────────────────────── */

#define WIFI_CHANNEL   6
#define MAX_CONNECTIONS 4

/* Device name — used for both WiFi SSID and BLE name.
 * Default: "QT_XXXX" where XXXX = last 4 hex digits of MAC.
 * Updated to station ID when learned from STM32 via SPI. */
static char device_name[32] = "";

static esp_netif_t *wifi_ap_netif = NULL;

/* ── WebSocket Client Tracking ─────────────────────────────────── */

#define MAX_WS_CLIENTS 4
static int ws_fds[MAX_WS_CLIENTS] = {0};
static httpd_handle_t ws_server = NULL;

static void ws_add_client(int fd)
{
    for (int i = 0; i < MAX_WS_CLIENTS; i++) {
        if (ws_fds[i] == 0) {
            ws_fds[i] = fd;
            ESP_LOGI(TAG, "WS client added: fd=%d", fd);
            return;
        }
    }
}

static void ws_remove_client(int fd)
{
    for (int i = 0; i < MAX_WS_CLIENTS; i++) {
        if (ws_fds[i] == fd) {
            ws_fds[i] = 0;
            ESP_LOGI(TAG, "WS client removed: fd=%d", fd);
            return;
        }
    }
}

static void ws_broadcast(const char *json)
{
    if (!ws_server) return;

    httpd_ws_frame_t ws_pkt = {
        .type = HTTPD_WS_TYPE_TEXT,
        .payload = (uint8_t *)json,
        .len = strlen(json),
    };

    for (int i = 0; i < MAX_WS_CLIENTS; i++) {
        if (ws_fds[i] != 0) {
            esp_err_t ret = httpd_ws_send_frame_async(ws_server, ws_fds[i], &ws_pkt);
            if (ret != ESP_OK) {
                ESP_LOGW(TAG, "WS send failed fd=%d: %s", ws_fds[i], esp_err_to_name(ret));
                ws_remove_client(ws_fds[i]);
            }
        }
    }
}

/* ── Web Page (generated from src/web/index.html via xxd) ──────── */

#include "web_data.h"

/* ── HTTP + WebSocket Handlers ─────────────────────────────────── */

static esp_err_t root_handler(httpd_req_t *req)
{
    httpd_resp_set_type(req, "text/html");
    httpd_resp_send(req, (const char *)src_web_index_html, src_web_index_html_len);
    return ESP_OK;
}

static int json_get_int(const char *json, const char *key, int def);
void save_duty_cycle(void);

/* ESP32 config: GET returns JSON, POST sets values */
static esp_err_t esp_config_get_handler(httpd_req_t *req)
{
    char buf[64];
    snprintf(buf, sizeof(buf), "{\"dutyCycle\":%d}", wifi_duty_cycle ? 1 : 0);
    httpd_resp_set_type(req, "application/json");
    httpd_resp_sendstr(req, buf);
    return ESP_OK;
}

static esp_err_t esp_config_post_handler(httpd_req_t *req)
{
    char buf[128];
    int len = httpd_req_recv(req, buf, sizeof(buf) - 1);
    if (len <= 0) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "No data");
        return ESP_FAIL;
    }
    buf[len] = '\0';

    int val = json_get_int(buf, "dutyCycle", -1);
    if (val >= 0) {
        wifi_duty_cycle = (val != 0);
        save_duty_cycle();
    }

    httpd_resp_sendstr(req, "OK");
    return ESP_OK;
}

/* Catch-all: any URL redirects to root page.
 * User instruction: connect to WiFi, open any URL (e.g. qt.com). */
static esp_err_t catchall_redirect_handler(httpd_req_t *req)
{
    httpd_resp_set_status(req, "302 Found");
    httpd_resp_set_hdr(req, "Location", "http://192.168.9.1/");
    httpd_resp_sendstr(req, "");
    return ESP_OK;
}

static esp_err_t ws_handler(httpd_req_t *req)
{
    if (req->method == HTTP_GET) {
        /* WebSocket handshake — track this client */
        int fd = httpd_req_to_sockfd(req);
        ws_add_client(fd);
        ESP_LOGI(TAG, "WS handshake: fd=%d", fd);
        return ESP_OK;
    }

    /* Receive command from browser */
    httpd_ws_frame_t ws_pkt = {0};
    ws_pkt.type = HTTPD_WS_TYPE_TEXT;
    uint8_t buf[512];
    ws_pkt.payload = buf;
    esp_err_t ret = httpd_ws_recv_frame(req, &ws_pkt, sizeof(buf));
    if (ret == ESP_OK && ws_pkt.len > 0 && ws_pkt.len < sizeof(buf)) {
        buf[ws_pkt.len] = '\0';
        portENTER_CRITICAL(&cmd_mux);
        strncpy(pending_cmd, (char *)buf, sizeof(pending_cmd) - 1);
        pending_cmd[sizeof(pending_cmd) - 1] = '\0';
        portEXIT_CRITICAL(&cmd_mux);
        ESP_LOGI(TAG, "WS cmd: %s", pending_cmd);
    } else if (ret != ESP_OK) {
        ESP_LOGW(TAG, "WS recv error: %s", esp_err_to_name(ret));
    }
    return ESP_OK;
}

/* ── OTA Firmware Update Handler ────────────────────────────────── */

static esp_err_t ota_handler(httpd_req_t *req)
{
    ESP_LOGI(TAG, "OTA update started, content_len=%d", req->content_len);

    const esp_partition_t *update_partition = esp_ota_get_next_update_partition(NULL);
    if (!update_partition) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "No OTA partition");
        return ESP_FAIL;
    }

    esp_ota_handle_t ota_handle;
    esp_err_t err = esp_ota_begin(update_partition, OTA_WITH_SEQUENTIAL_WRITES, &ota_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "esp_ota_begin failed: %s", esp_err_to_name(err));
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "OTA begin failed");
        return ESP_FAIL;
    }

    char buf[1024];
    int received = 0;
    int total = req->content_len;

