chriskinal/QuailTracker/esp32_bridge/src/main.c
    while (received < total) {
        int ret = httpd_req_recv(req, buf, sizeof(buf));
        if (ret <= 0) {
            if (ret == HTTPD_SOCK_ERR_TIMEOUT) continue;
            ESP_LOGE(TAG, "OTA recv error at %d/%d", received, total);
            esp_ota_abort(ota_handle);
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Receive error");
            return ESP_FAIL;
        }

        err = esp_ota_write(ota_handle, buf, ret);
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "esp_ota_write failed: %s", esp_err_to_name(err));
            esp_ota_abort(ota_handle);
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Write error");
            return ESP_FAIL;
        }

        received += ret;
        if ((received % (64 * 1024)) == 0 || received == total) {
            ESP_LOGI(TAG, "OTA progress: %d/%d (%d%%)",
                     received, total, received * 100 / total);
        }
    }

    err = esp_ota_end(ota_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "esp_ota_end failed: %s", esp_err_to_name(err));
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Validation failed");
        return ESP_FAIL;
    }

    err = esp_ota_set_boot_partition(update_partition);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "esp_ota_set_boot_partition failed: %s", esp_err_to_name(err));
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Set boot failed");
        return ESP_FAIL;
    }

    ESP_LOGI(TAG, "OTA update complete (%d bytes), rebooting...", received);
    httpd_resp_sendstr(req, "OK");

    /* Reboot after short delay to let response send */
    vTaskDelay(pdMS_TO_TICKS(500));
    esp_restart();

    return ESP_OK;  /* never reached */
}

/* ── STM32 Firmware Flash Handler ──────────────────────────────── */

/* Stage 1: Receive firmware via HTTP into the "stm32fw" flash partition.
 * Stage 2: Read back from flash and write to STM32 via SPI bootloader.
 * This avoids needing 330KB+ of heap — flash is the staging buffer. */

extern bool spi_initialized;
extern void spi_slave_init(void);
static void spi_task(void *arg);

/* STM32 flash progress — updated by stm32_flash, read by status endpoint */
static volatile int stm32_flash_pct = -1;  /* -1 = not flashing */

#include "esp_partition.h"
#define STM32FW_PARTITION_LABEL "stm32fw"

static void stm32_flash_progress(int pct)
{
    stm32_flash_pct = pct;
    /* Push progress over WebSocket so browser updates in real time */
    if (ws_server) {
        char json[48];
        snprintf(json, sizeof(json), "{\"stm32flash\":%d}", pct);
        ws_broadcast(json);
    }
}

static esp_err_t flash_status_handler(httpd_req_t *req)
{
    char buf[32];
    snprintf(buf, sizeof(buf), "{\"pct\":%d}", stm32_flash_pct);
    httpd_resp_set_type(req, "application/json");
    httpd_resp_sendstr(req, buf);
    return ESP_OK;
}

static esp_err_t stm32_ota_handler(httpd_req_t *req)
{
    ESP_LOGI(TAG, "STM32 flash started, content_len=%d", req->content_len);

    if (req->content_len <= 0 || req->content_len > 512 * 1024) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Invalid firmware size");
        return ESP_FAIL;
    }

    /* Find the staging partition */
    const esp_partition_t *part = esp_partition_find_first(
        ESP_PARTITION_TYPE_DATA, 0x80, STM32FW_PARTITION_LABEL);
    if (!part) {
        ESP_LOGE(TAG, "stm32fw partition not found");
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "No staging partition");
        return ESP_FAIL;
    }

    /* Erase the staging partition */
    esp_err_t err = esp_partition_erase_range(part, 0, part->size);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Partition erase failed: %s", esp_err_to_name(err));
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Erase failed");
        return ESP_FAIL;
    }

    /* Stage 1: Receive firmware and write to flash partition */
    int total = req->content_len;
    int received = 0;
    char buf[1024];

    while (received < total) {
        int ret = httpd_req_recv(req, buf, sizeof(buf));
        if (ret <= 0) {
            if (ret == HTTPD_SOCK_ERR_TIMEOUT) continue;
            ESP_LOGE(TAG, "Receive error at %d/%d", received, total);
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Receive error");
            return ESP_FAIL;
        }

        err = esp_partition_write(part, received, buf, ret);
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "Partition write failed at %d: %s", received, esp_err_to_name(err));
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Write failed");
            return ESP_FAIL;
        }

        received += ret;
        if ((received % (64 * 1024)) == 0 || received == total) {
            ESP_LOGI(TAG, "Staged %d / %d bytes (%d%%)",
                     received, total, received * 100 / total);
        }
    }
    ESP_LOGI(TAG, "Firmware staged (%d bytes), starting STM32 flash", received);
    stm32_flash_pct = 0;

    /* Stage 2: Stop SPI task, free SPI slave, flash STM32 from partition */
    spi_task_stop = true;
    /* Wait for SPI task to exit (it checks the flag every iteration) */
    for (int i = 0; i < 50 && spi_task_handle != NULL; i++)
        vTaskDelay(pdMS_TO_TICKS(100));
    ESP_LOGI(TAG, "SPI task stopped");

    if (spi_initialized) {
        spi_slave_free(SPI_HOST);
        spi_initialized = false;
    }

    int rc = stm32_flash_from_partition(part, (uint32_t)received, stm32_flash_progress);

    /* Re-initialize SPI slave and restart task */
    spi_slave_init();
    spi_task_stop = false;
    xTaskCreate(spi_task, "spi_task", 4096, NULL, 3, &spi_task_handle);

    if (rc != STM32_FLASH_OK) {
        stm32_flash_pct = -1;
        char errmsg[64];
        snprintf(errmsg, sizeof(errmsg), "Flash failed (error %d)", rc);
        ESP_LOGE(TAG, "%s", errmsg);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, errmsg);
        return ESP_FAIL;
    }

    stm32_flash_pct = 100;
    ESP_LOGI(TAG, "STM32 flash complete, device rebooted");
    httpd_resp_sendstr(req, "OK");
    stm32_flash_pct = -1;
    return ESP_OK;
}

static httpd_handle_t start_webserver(void)
{
    if (ws_server) return ws_server;  /* already running */

    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.max_uri_handlers = 8;
    config.stack_size = 8192;
    config.uri_match_fn = httpd_uri_match_wildcard;  /* enable wildcard URI matching */
    httpd_handle_t server = NULL;

