chriskinal/QuailTracker/esp32_bridge/src/main.c
static void wifi_stop(void)
{
    if (!wifi_started) return;

    stop_webserver();
    esp_wifi_stop();
    wifi_started = false;
    ESP_LOGI(TAG, "WiFi AP stopped");
}

/* ── STM32 Wake (pull CS pin low for 10ms) ─────────────────────── */

static void stm32_wake(void)
{
    if (!stm32_sleeping) return;

    ESP_LOGI(TAG, "Waking STM32 via GPIO5 (CS) pulse");

    /* Temporarily reconfigure GPIO5 from SPI CS to GPIO output */
    if (spi_initialized) {
        spi_slave_free(SPI_HOST);
        spi_initialized = false;
    }

    gpio_config_t io = {
        .pin_bit_mask = (1ULL << PIN_CS),
        .mode = GPIO_MODE_OUTPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&io);

    /* Pull LOW for 10ms to trigger EXTI0 on STM32 */
    gpio_set_level(PIN_CS, 0);
    vTaskDelay(pdMS_TO_TICKS(10));
    gpio_set_level(PIN_CS, 1);

    /* Wait for STM32 to wake and restore SPI */
    vTaskDelay(pdMS_TO_TICKS(100));
    stm32_sleeping = false;
}

/* ── STM32 Control Pins (high-Z until needed for flashing) ───── */

#define PIN_STM32_NRST   2
#define PIN_STM32_BOOT0  3

static void stm32_pins_init(void)
{
    gpio_config_t io_conf = {
        .pin_bit_mask = (1ULL << PIN_STM32_BOOT0) | (1ULL << PIN_STM32_NRST),
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&io_conf);
    ESP_LOGI(TAG, "STM32 BOOT0/NRST pins set to high-Z");
}

/* ── SPI Slave Init/Deinit ─────────────────────────────────────── */

void spi_slave_init(void)
{
    if (spi_initialized) return;

    spi_bus_config_t busCfg = {
        .mosi_io_num = PIN_MOSI,
        .miso_io_num = PIN_MISO,
        .sclk_io_num = PIN_SCK,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = TRANSFER_SIZE,
    };

    spi_slave_interface_config_t slaveCfg = {
        .mode = 0,
        .spics_io_num = PIN_CS,
        .queue_size = 3,
        .flags = 0,
    };

    ESP_ERROR_CHECK(spi_slave_initialize(SPI_HOST, &busCfg, &slaveCfg, SPI_DMA_CH_AUTO));
    spi_initialized = true;
    ESP_LOGI(TAG, "SPI slave initialized");
}

/* Parse a simple integer value from JSON: "key":123 */
static int json_get_int(const char *json, const char *key, int def)
{
    char search[32];
    snprintf(search, sizeof(search), "\"%s\":", key);
    const char *p = strstr(json, search);
    if (!p) return def;
    p += strlen(search);
    return atoi(p);
}

/* Parse a string value from JSON: "key":"value" into buf (max buflen-1 chars) */
static bool json_get_str(const char *json, const char *key, char *buf, int buflen)
{
    char search[32];
    snprintf(search, sizeof(search), "\"%s\":\"", key);
    const char *p = strstr(json, search);
    if (!p) return false;
    p += strlen(search);
    const char *end = strchr(p, '"');
    if (!end) return false;
    int len = end - p;
    if (len >= buflen) len = buflen - 1;
    memcpy(buf, p, len);
    buf[len] = '\0';
    return true;
}

/* ── SPI Slave Task ────────────────────────────────────────────── */

static void spi_task(void *arg)
{
    while (1) {
        if (spi_task_stop) {
            ESP_LOGI(TAG, "SPI task stopping");
            spi_task_handle = NULL;
            vTaskDelete(NULL);
            return;
        }
        if (!spi_initialized) {
            vTaskDelay(pdMS_TO_TICKS(100));
            continue;
        }

        memset(spi_txBuf, 0, TRANSFER_SIZE);
        portENTER_CRITICAL(&cmd_mux);
        if (pending_cmd[0]) {
            strncpy((char *)spi_txBuf, pending_cmd, TRANSFER_SIZE - 1);
            pending_cmd[0] = '\0';
        } else {
            snprintf((char *)spi_txBuf, TRANSFER_SIZE,
                     "{\"espFw\":\"%s\"}", ESP_FW_VERSION);
        }
        portEXIT_CRITICAL(&cmd_mux);
        memset(spi_rxBuf, 0, TRANSFER_SIZE);

        spi_slave_transaction_t trans = {
            .length = TRANSFER_SIZE * 8,
            .tx_buffer = spi_txBuf,
            .rx_buffer = spi_rxBuf,
        };

        esp_err_t ret = spi_slave_transmit(SPI_HOST, &trans, pdMS_TO_TICKS(1000));
        vTaskDelay(pdMS_TO_TICKS(1));  /* yield to lower-priority tasks */
        if (ret == ESP_OK) {
            spi_transaction_count++;

            int len = trans.trans_len / 8;
            if (len > TRANSFER_SIZE) len = TRANSFER_SIZE;
            if (len > 0 && spi_rxBuf[0] == '{') {
                /* JSON status from STM32 — store and flag for broadcast */
                memcpy(last_spi_msg, spi_rxBuf, len);
                last_spi_msg[len] = '\0';
                new_spi_data = true;

                /* Extract battery/state for BLE advertising */
                last_battery_mv = (uint16_t)json_get_int(last_spi_msg, "bat", 0);
                last_recording = (uint8_t)json_get_int(last_spi_msg, "rec", 0);
                last_pwr_state = (uint8_t)json_get_int(last_spi_msg, "pwrState", 0);

                /* Update device name from station ID if changed */
                {
                    char station[16];
                    if (json_get_str(last_spi_msg, "station", station, sizeof(station))
                        && station[0]) {
                        update_device_name(station);
                    }
                }

                /* Track STM32 sleep state for wake functionality */
                if (json_get_int(last_spi_msg, "sleeping", -1) == 1) {
                    stm32_sleeping = true;
                }

                /* SPI rx logging removed — runs 4x/sec, too noisy */
            }
        }
    }
}

/* ── WebSocket Push Task ───────────────────────────────────────── */

static void ws_push_task(void *arg)
{
    while (1) {
        vTaskDelay(pdMS_TO_TICKS(500));

        if (new_spi_data && ws_server) {
            new_spi_data = false;
            /* Inject ESP32 firmware version into JSON before broadcasting.
             * Replace trailing '}' with ',"espFw":"x.y.z"}' */
            int len = strlen(last_spi_msg);
            if (len > 1 && last_spi_msg[len - 1] == '}') {
                snprintf(last_spi_msg + len - 1,
                         sizeof(last_spi_msg) - len + 1,
                         ",\"espFw\":\"%s\"}", ESP_FW_VERSION);
            }
            ws_broadcast(last_spi_msg);
        }

